Mi-Bee-Studio/seeed-esp32s3-cam/sdkconfig.defaults

# Target
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=240

# PSRAM (8MB Octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
# Run Octal PSRAM at 80MHz (up from default 40MHz) for ~2x memcpy bandwidth.
# Octal DDR mode requires 64B cache line (set below); 80MHz is supported by the ESP32-S3 PSRAM controller.
CONFIG_SPIRAM_SPEED_80M=y

# Cache line size MUST be 64B for Octal PSRAM DDR mode (32B causes data corruption)
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Flash 8MB
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Watchdog
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# Camera (XIAO ESP32S3 Sense pin mapping)
CONFIG_CAMERA_PIN_PWDN=-1
CONFIG_CAMERA_PIN_RESET=-1
CONFIG_CAMERA_PIN_XCLK=10
CONFIG_CAMERA_PIN_SIOD=40
CONFIG_CAMERA_PIN_SIOC=39
CONFIG_CAMERA_PIN_D7=48
CONFIG_CAMERA_PIN_D6=11
CONFIG_CAMERA_PIN_D5=12
CONFIG_CAMERA_PIN_D4=14
CONFIG_CAMERA_PIN_D3=16
CONFIG_CAMERA_PIN_D2=18
CONFIG_CAMERA_PIN_D1=17
CONFIG_CAMERA_PIN_D0=15
CONFIG_CAMERA_PIN_VSYNC=38
CONFIG_CAMERA_PIN_HREF=47
CONFIG_CAMERA_PIN_PCLK=13

CONFIG_CAMERA_PSRAM_DMA=n
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE_CUSTOM=y
CONFIG_CAMERA_JPEG_MODE_FRAME_SIZE=524288

# I2S PDM Microphone (XIAO ESP32-S3 Sense onboard MEMS mic)
CONFIG_I2S_PDM_RX_GPIO_CLK=42
CONFIG_I2S_PDM_RX_GPIO_DATA=41

# SD card: currently uses SDSPI mode (see main/storage_manager.c).
# SDMMC 1-bit mode would free GPIO10 for camera XCLK, but requires the SDMMC
# host driver + CMD pin wiring verification. Tracked as a future optimization.
# (CONFIG_SD_MMC_1_LINE_MODE was removed: not a real ESP-IDF v6.0 Kconfig symbol.)

# FatFS
CONFIG_FATFS_FS_LOCK=10
CONFIG_FATFS_ALLOC_PREFER_EXTRAM=n

# WiFi
# AMPDU aggregation significantly improves MJPEG/RTSP streaming throughput by
# allowing multiple frames per TXOP. Was disabled (legacy default); re-enabled.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
# LWIP
CONFIG_LWIP_MAX_SOCKETS=10
CONFIG_LWIP_SO_REUSE=y
CONFIG_LWIP_SO_REUSE_RXTOALL=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3
CONFIG_LOG_COLORS=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_MAX_TASK_NAME_LEN=16
CONFIG_FREERTOS_DEFAULT_TASK_STACK_SIZE=4096
CONFIG_ESP_TIMER_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# SPIFFS
CONFIG_SPIFFS=y

# WebSocket support
CONFIG_HTTPD_WS_SUPPORT=y

# System event task stack (increased for mDNS init in wifi event handler)
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
